Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

Ans.

In [1]:
import pandas as pd

In [3]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
data = [4,8,15,16,23,42]
my_series = pd.Series(data)
print(my_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

Ans.

In [3]:
l = [1,2,3,4,5,6,7,8,9,3]
pd.Series(l)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9    3
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
    Then Print the DataFrame.
    
Ans.

In [4]:
data = {
    'Name' : ['Alice','Bob','Claire'],
    'Age' : [25,30,27],
    'Gender' : ['Female','Male','Female']
}
df = pd.DataFrame(data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans.  DataFrame:

A DataFrame is a two-dimensional, tabular data structure that resembles a spreadsheet or a SQL table.
It is similar to a collection of Pandas Series where each column is a Series, and columns can have different data types.
It is often used to represent and manipulate structured data, such as datasets with rows and columns.
You can think of a DataFrame as a container for Series objects, where each column is a Series.

Series:

A Series, on the other hand, is a one-dimensional labeled array capable of holding data of any type.
It is like a single column of data in a DataFrame.
Series is often used to represent a single column or row of data, or as the output of a single column selection from a DataFrame.

Example:

In [5]:
data = {
    'Name' : ['Alice','Bob','Claire'],
    'Age' : [25,30,27],
    'Gender' : ['Female','Male','Female']
}
df = pd.DataFrame(data)

age_series = df['Age']

print("DataFrame:")
print(df)
print("\nSeries (Age):")
print(age_series)

DataFrame:
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Series (Age):
0    25
1    30
2    27
Name: Age, dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans. Pandas provides a wide range of functions to manipulate and analyze data in a DataFrame. Here are some common functions and methods frequently used for data manipulation in a Pandas DataFrame, along with examples of when you might use them:

head() and tail(): These functions allow you to view the first or last few rows of a DataFrame. They are useful for quickly inspecting data.

In [6]:
# View the first 5 rows of a DataFrame
df.head()

# View the last 3 rows of a DataFrame
df.tail(3)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

info(): Provides information about the DataFrame, including the data types, non-null counts, and memory usage. Useful for understanding the dataset's structure.

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

sort_values(): Sorts the DataFrame by one or more columns. Useful for arranging data in ascending or descending order.

In [8]:
# Sort by the "Age" column in ascending order
df.sort_values(by='Age', ascending=True)

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

groupby(): Groups data based on one or more columns and allows you to perform aggregate operations (e.g., sum, mean, count) on the groups.

In [9]:
# Group by "Gender" and calculate the average age in each group
df.groupby('Gender')['Age'].mean()

Gender
Female    26.0
Male      30.0
Name: Age, dtype: float64

pivot_table(): Creates a pivot table, summarizing data by aggregating values from rows and columns. Useful for cross-tabulation and summary reports.

In [10]:
# Create a pivot table to summarize data
pd.pivot_table(df, values='Age', index='Gender', columns='Name', aggfunc='mean')

Name    Alice   Bob  Claire
Gender
Female   25.0   NaN    27.0
Male      NaN  30.0     NaN

drop(): Allows you to remove rows or columns from the DataFrame.

In [11]:
# Remove the "Age" column
df = df.drop(columns=['Age'])

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans.  Series: A Pandas Series is one-dimensional and mutable. This means you can change the values of individual elements within a Series after it has been created. You can use indexing to modify specific elements.

DataFrame: A Pandas DataFrame is two-dimensional and mutable. You can change the values of individual cells or entire columns within a DataFrame. You can also add or remove columns.

Panel: A Panel was a three-dimensional data structure in older versions of Pandas (prior to version 0.25). However, Panels have been deprecated in more recent versions of Pandas, and users are encouraged to use MultiIndex DataFrames or other data structures instead. Panels were mutable when they existed.

Q7. Create a DataFrame using multiple Series. Explain with an example.

Ans.

In [13]:
name_series = pd.Series(['Akul' , 'Rahul' , 'Sammer'])
age_series = pd.Series([20 , 22 , 21])
df = pd.DataFrame({'Name' : name_series , 'Age' : age_series})
print(df)

     Name  Age
0    Akul   20
1   Rahul   22
2  Sammer   21